venue-activity-status-project/tests/Present/App/Services/stripe_subscriptions.json

{
    "object": "list",
    "data": [
        {
            "id": "sub_1OdsMdIaggH0dDzX6WtvX3a6",
            "object": "subscription",
            "application": "ca_Fvdc0D3lIZSnKpciamxH5xpzukwagdFY",
            "application_fee_percent": null,
            "automatic_tax": {
                "enabled": false,
                "liability": null
            },
            "billing": "charge_automatically",
            "billing_cycle_anchor": 1706525215,
            "billing_cycle_anchor_config": null,
            "billing_thresholds": null,
            "cancel_at": null,
            "cancel_at_period_end": false,
            "canceled_at": null,
            "cancellation_details": {
                "comment": null,
                "feedback": null,
                "reason": null
            },
            "collection_method": "charge_automatically",
            "created": 1706525215,
            "currency": "dkk",
            "current_period_end": 1709203615,
            "current_period_start": 1706525215,
            "customer": "cus_MatDIfdyIC4gZM",
            "days_until_due": null,
            "default_payment_method": null,
            "default_source": null,
            "default_tax_rates": [
                {
                    "id": "txr_1FRGhfIaggH0dDzXsYUAyXKz",
                    "object": "tax_rate",
                    "active": true,
                    "country": null,
                    "created": 1570533487,
                    "description": null,
                    "display_name": "VAT",
                    "effective_percentage": null,
                    "inclusive": false,
                    "jurisdiction": "DK",
                    "jurisdiction_level": null,
                    "livemode": false,
                    "metadata": [],
                    "percentage": 25,
                    "state": null,
                    "tax_type": null
                }
            ],
            "description": null,
            "discount": null,
            "ended_at": null,
            "invoice_customer_balance_settings": {
                "consume_applied_balance_on_void": true
            },
            "invoice_settings": {
                "account_tax_ids": null,
                "issuer": {
                    "type": "self"
                }
            },
            "items": {
                "object": "list",
                "data": [
                    {
                        "id": "si_PSnyI5tYtLCiUe",
                        "object": "subscription_item",
                        "billing_thresholds": null,
                        "created": 1706525215,
                        "metadata": [],
                        "plan": {
                            "id": "price_1MqBIIIaggH0dDzXhtdMN3E6",
                            "object": "plan",
                            "active": true,
                            "aggregate_usage": null,
                            "amount": null,
                            "amount_decimal": null,
                            "billing_scheme": "tiered",
                            "created": 1679905246,
                            "currency": "dkk",
                            "interval": "month",
                            "interval_count": 1,
                            "livemode": false,
                            "metadata": [],
                            "nickname": "Lite 2023",
                            "product": "prod_H0iMOFgOwHkA2K",
                            "tiers": [
                                {
                                    "flat_amount": null,
                                    "flat_amount_decimal": null,
                                    "unit_amount": 75000,
                                    "unit_amount_decimal": "75000",
                                    "up_to": 1
                                },
                                {
                                    "flat_amount": null,
                                    "flat_amount_decimal": null,
                                    "unit_amount": 35000,
                                    "unit_amount_decimal": "35000",
                                    "up_to": null
                                }
                            ],
                            "tiers_mode": "graduated",
                            "transform_usage": null,
                            "trial_period_days": null,
                            "usage_type": "licensed"
                        },
                        "price": {
                            "id": "price_1MqBIIIaggH0dDzXhtdMN3E6",
                            "object": "price",
                            "active": true,
                            "billing_scheme": "tiered",
                            "created": 1679905246,
                            "currency": "dkk",
                            "custom_unit_amount": null,
                            "livemode": false,
                            "lookup_key": null,
                            "metadata": [],
                            "nickname": "Lite 2023",
                            "product": "prod_H0iMOFgOwHkA2K",
                            "recurring": {
                                "aggregate_usage": null,
                                "interval": "month",
                                "interval_count": 1,
                                "trial_period_days": null,
                                "usage_type": "licensed"
                            },
                            "tax_behavior": "unspecified",
                            "tiers_mode": "graduated",
                            "transform_quantity": null,
                            "type": "recurring",
                            "unit_amount": null,
                            "unit_amount_decimal": null
                        },
                        "quantity": 1,
                        "subscription": "sub_1OdsMdIaggH0dDzX6WtvX3a6",
                        "tax_rates": []
                    }
                ],
                "has_more": false,
                "total_count": 1,
                "url": "\/v1\/subscription_items?subscription=sub_1OdsMdIaggH0dDzX6WtvX3a6"
            },
            "latest_invoice": "in_1OdsMdIaggH0dDzXohKPLLnw",
            "livemode": false,
            "metadata": [],
            "next_pending_invoice_item_invoice": null,
            "on_behalf_of": null,
            "pause_collection": null,
            "payment_settings": {
                "payment_method_options": null,
                "payment_method_types": null,
                "save_default_payment_method": "off"
            },
            "pending_invoice_item_interval": null,
            "pending_setup_intent": null,
            "pending_update": null,
            "plan": {
                "id": "price_1MqBIIIaggH0dDzXhtdMN3E6",
                "object": "plan",
                "active": true,
                "aggregate_usage": null,
                "amount": null,
                "amount_decimal": null,
                "billing_scheme": "tiered",
                "created": 1679905246,
                "currency": "dkk",
                "interval": "month",
                "interval_count": 1,
                "livemode": false,
                "metadata": [],
                "nickname": "Lite 2023",
                "product": "prod_H0iMOFgOwHkA2K",
                "tiers": [
                    {
                        "flat_amount": null,
                        "flat_amount_decimal": null,
                        "unit_amount": 75000,
                        "unit_amount_decimal": "75000",
                        "up_to": 1
                    },
                    {
                        "flat_amount": null,
                        "flat_amount_decimal": null,
                        "unit_amount": 35000,
                        "unit_amount_decimal": "35000",
                        "up_to": null
                    }
                ],
                "tiers_mode": "graduated",
                "transform_usage": null,
                "trial_period_days": null,
                "usage_type": "licensed"
            },
            "quantity": 1,
            "schedule": null,
            "start": 1706525215,
            "start_date": 1706525215,
            "status": "active",
            "tax_percent": 25,
            "test_clock": null,
            "transfer_data": null,
            "trial_end": null,
            "trial_settings": {
                "end_behavior": {
                    "missing_payment_method": "create_invoice"
                }
            },
            "trial_start": null
        },
        {
            "id": "sub_1OgP5SAVLAGyPgE42eUfAV64",
            "object": "subscription",
            "application": "ca_Fvdc0D3lIZSnKpciamxH5xpzukwagdFY",
            "application_fee_percent": null,
            "automatic_tax": {
                "enabled": false,
                "liability": null
            },
            "billing": "charge_automatically",
            "billing_cycle_anchor": 1707127658,
            "billing_cycle_anchor_config": null,
            "billing_thresholds": null,
            "cancel_at": null,
            "cancel_at_period_end": false,
            "canceled_at": null,
            "cancellation_details": {
                "comment": null,
                "feedback": null,
                "reason": null
            },
            "collection_method": "charge_automatically",
            "created": 1707127658,
            "currency": "nok",
            "current_period_end": 1709633258,
            "current_period_start": 1707127658,
            "customer": "cus_LcDeKgBjjdU6SC",
            "days_until_due": null,
            "default_payment_method": null,
            "default_source": null,
            "default_tax_rates": [],
            "description": null,
            "discount": null,
            "ended_at": null,
            "invoice_customer_balance_settings": {
                "consume_applied_balance_on_void": true
            },
            "invoice_settings": {
                "account_tax_ids": null,
                "issuer": {
                    "type": "self"
                }
            },
            "items": {
                "object": "list",
                "data": [
                    {
                        "id": "si_PVPvk3ADBxoPHt",
                        "object": "subscription_item",
                        "billing_thresholds": null,
                        "created": 1707127658,
                        "metadata": [],
                        "plan": {
                            "id": "plan_G7KJkE3ItFNbqR",
                            "object": "plan",
                            "active": true,
                            "aggregate_usage": null,
                            "amount": null,
                            "amount_decimal": null,
                            "billing_scheme": "tiered",
                            "created": 1572874286,
                            "currency": "nok",
                            "interval": "month",
                            "interval_count": 1,
                            "livemode": false,
                            "metadata": [],
                            "nickname": "Monthly",
                            "product": "prod_G0CAMIJxBVUM4R",
                            "tiers": [
                                {
                                    "flat_amount": null,
                                    "flat_amount_decimal": null,
                                    "unit_amount": 4000,
                                    "unit_amount_decimal": "4000",
                                    "up_to": 50
                                },
                                {
                                    "flat_amount": null,
                                    "flat_amount_decimal": null,
                                    "unit_amount": 3200,
                                    "unit_amount_decimal": "3200",
                                    "up_to": null
                                }
                            ],
                            "tiers_mode": "graduated",
                            "transform_usage": null,
                            "trial_period_days": null,
                            "usage_type": "licensed"
                        },
                        "price": {
                            "id": "plan_G7KJkE3ItFNbqR",
                            "object": "price",
                            "active": true,
                            "billing_scheme": "tiered",
                            "created": 1572874286,
                            "currency": "nok",
                            "custom_unit_amount": null,
                            "livemode": false,
                            "lookup_key": null,
                            "metadata": [],
                            "nickname": "Monthly",
                            "product": "prod_G0CAMIJxBVUM4R",
                            "recurring": {
                                "aggregate_usage": null,
                                "interval": "month",
                                "interval_count": 1,
                                "trial_period_days": null,
                                "usage_type": "licensed"
                            },
                            "tax_behavior": "unspecified",
                            "tiers_mode": "graduated",
                            "transform_quantity": null,
                            "type": "recurring",
                            "unit_amount": null,
                            "unit_amount_decimal": null
                        },
                        "quantity": 1,
                        "subscription": "sub_1OgP5SAVLAGyPgE42eUfAV64",
                        "tax_rates": []
                    }
                ],
                "has_more": false,
                "total_count": 1,
                "url": "\/v1\/subscription_items?subscription=sub_1OgP5SAVLAGyPgE42eUfAV64"
            },
            "latest_invoice": "in_1OgP5SAVLAGyPgE435puhaZn",
            "livemode": false,
            "metadata": [],
            "next_pending_invoice_item_invoice": null,
            "on_behalf_of": null,
            "pause_collection": null,
            "payment_settings": {
                "payment_method_options": null,
                "payment_method_types": null,
                "save_default_payment_method": "off"
            },
            "pending_invoice_item_interval": null,
            "pending_setup_intent": null,
            "pending_update": null,
            "plan": {
                "id": "plan_G7KJkE3ItFNbqR",
                "object": "plan",
                "active": true,
                "aggregate_usage": null,
                "amount": null,
                "amount_decimal": null,
                "billing_scheme": "tiered",
                "created": 1572874286,
                "currency": "nok",
                "interval": "month",
                "interval_count": 1,
                "livemode": false,
                "metadata": [],
                "nickname": "Monthly",
                "product": "prod_G0CAMIJxBVUM4R",
                "tiers": [
                    {
                        "flat_amount": null,
                        "flat_amount_decimal": null,
                        "unit_amount": 4000,
                        "unit_amount_decimal": "4000",
                        "up_to": 50
                    },
                    {
                        "flat_amount": null,
                        "flat_amount_decimal": null,
                        "unit_amount": 3200,
                        "unit_amount_decimal": "3200",
                        "up_to": null
                    }
                ],
                "tiers_mode": "graduated",
                "transform_usage": null,
                "trial_period_days": null,
                "usage_type": "licensed"
            },
            "quantity": 1,
            "schedule": null,
            "start": 1707127658,
            "start_date": 1707127658,
            "status": "active",
            "tax_percent": null,
            "test_clock": null,
            "transfer_data": null,
            "trial_end": null,
            "trial_settings": {
                "end_behavior": {
                    "missing_payment_method": "create_invoice"
                }
            },
            "trial_start": null
        }
    ],
    "has_more": false,
    "url": "\/v1\/subscriptions"
}
